---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ReferenceViewerTargetView
source: html/909e6adf-e0d7-e1de-54b7-1b41a273f8f8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ReferenceViewerTargetView Property

"Target view"

## Syntax (C#)
```csharp
public static ForgeTypeId ReferenceViewerTargetView { get; }
```